#include "1.h"

void gorschock(Paramets& gorsh) {
	glPushMatrix();
	glTranslatef(gorsh.x, gorsh.y, 0);
	glBegin(GL_QUADS);

	glColor3ub(0, 0, 0);
	glVertex2f(-0.04, 0.46); // Ћева€ нижн€€ вершина
	glVertex2f(-0.03, 0.5); // ѕрава€ нижн€€ вершина
	glVertex2f(-0.08, 0.56); // ѕрава€ верхн€€ вершина
	glVertex2f(-0.08, 0.56); // Ћева€ верхн€€ вершина

	glColor3ub(0, 0, 0);
	glVertex2f(-0.03, 0.5); // Ћева€ нижн€€ вершина
	glVertex2f(0, 0.5); // ѕрава€ нижн€€ вершина
	glVertex2f(-0.02, 0.59); // ѕрава€ верхн€€ вершина
	glVertex2f(-0.02, 0.59); // Ћева€ верхн€€ вершина

	glColor3ub(0, 0, 0);
	glVertex2f(0, 0.5); // Ћева€ нижн€€ вершина
	glVertex2f(0.05, 0.5); // ѕрава€ нижн€€ вершина
	glVertex2f(0.03, 0.6); // ѕрава€ верхн€€ вершина
	glVertex2f(0.03, 0.6); // Ћева€ верхн€€ вершина

	glColor3ub(0, 0, 0);
	glVertex2f(0.05, 0.5); // Ћева€ нижн€€ вершина
	glVertex2f(0.09, 0.5); // ѕрава€ нижн€€ вершина
	glVertex2f(0.07, 0.6); // ѕрава€ верхн€€ вершина
	glVertex2f(0.07, 0.6); // Ћева€ верхн€€ вершина

	glColor3ub(0, 0, 0);
	glVertex2f(0.1, 0.5); // Ћева€ нижн€€ вершина
	glVertex2f(0.14, 0.5); // ѕрава€ нижн€€ вершина
	glVertex2f(0.12, 0.58); // ѕрава€ верхн€€ вершина
	glVertex2f(0.12, 0.58); // Ћева€ верхн€€ вершина

	glColor3ub(0, 0, 0);
	glVertex2f(0.15, 0.5); // Ћева€ нижн€€ вершина
	glVertex2f(0.16, 0.46); // ѕрава€ нижн€€ вершина
	glVertex2f(0.2, 0.56); // ѕрава€ верхн€€ вершина
	glVertex2f(0.2, 0.56); // Ћева€ верхн€€ вершина

	glColor3ub(0, 0, 0);
	glVertex2f(-0.04, 0.46); // Ћева€ нижн€€ вершина
	glVertex2f(0, 0.46); // ѕрава€ нижн€€ вершина
	glVertex2f(0, 0.5); // ѕрава€ верхн€€ вершина
	glVertex2f(-0.04, 0.5); // Ћева€ верхн€€ вершина

	glColor3ub(0, 0, 0);
	glVertex2f(0, 0.46); // Ћева€ нижн€€ вершина
	glVertex2f(0.04, 0.46); // ѕрава€ нижн€€ вершина
	glVertex2f(0.04, 0.5); // ѕрава€ верхн€€ вершина
	glVertex2f(0, 0.5); // Ћева€ верхн€€ вершина

	glColor3ub(0, 0, 0);
	glVertex2f(0.04, 0.46); // Ћева€ нижн€€ вершина
	glVertex2f(0.08, 0.46); // ѕрава€ нижн€€ вершина
	glVertex2f(0.08, 0.5); // ѕрава€ верхн€€ вершина
	glVertex2f(0.04, 0.5); // Ћева€ верхн€€ вершина

	glColor3ub(0, 0, 0);
	glVertex2f(0.08, 0.46); // Ћева€ нижн€€ вершина
	glVertex2f(0.12, 0.46); // ѕрава€ нижн€€ вершина
	glVertex2f(0.12, 0.5); // ѕрава€ верхн€€ вершина
	glVertex2f(0.08, 0.5); // Ћева€ верхн€€ вершина

	glColor3ub(0, 0, 0);
	glVertex2f(0.12, 0.46); // Ћева€ нижн€€ вершина
	glVertex2f(0.16, 0.46); // ѕрава€ нижн€€ вершина
	glVertex2f(0.16, 0.5); // ѕрава€ верхн€€ вершина
	glVertex2f(0.12, 0.5); // Ћева€ верхн€€ вершина

	glColor3ub(0, 0, 0);
	glVertex2f(-0.04, 0.42); // Ћева€ нижн€€ вершина
	glVertex2f(-0.02, 0.46); // ѕрава€ нижн€€ вершина
	glVertex2f(-0.11, 0.5); // ѕрава€ верхн€€ вершина
	glVertex2f(-0.11, 0.5); // Ћева€ верхн€€ вершина

	glColor3ub(0, 0, 0);
	glVertex2f(-0.04, 0.42); // Ћева€ нижн€€ вершина
	glVertex2f(0, 0.42); // ѕрава€ нижн€€ вершина
	glVertex2f(0, 0.46); // ѕрава€ верхн€€ вершина
	glVertex2f(-0.04, 0.46); // Ћева€ верхн€€ вершина

	glColor3ub(0, 0, 0);
	glVertex2f(0, 0.42); // Ћева€ нижн€€ вершина
	glVertex2f(0.04, 0.42); // ѕрава€ нижн€€ вершина
	glVertex2f(0.04, 0.46); // ѕрава€ верхн€€ вершина
	glVertex2f(0, 0.46); // Ћева€ верхн€€ вершина

	glColor3ub(0, 0, 0);
	glVertex2f(0, 0.42); // Ћева€ нижн€€ вершина
	glVertex2f(0.04, 0.42); // ѕрава€ нижн€€ вершина
	glVertex2f(0.04, 0.46); // ѕрава€ верхн€€ вершина
	glVertex2f(0, 0.46); // Ћева€ верхн€€ вершина

	glColor3ub(0, 0, 0);
	glVertex2f(0.04, 0.42); // Ћева€ нижн€€ вершина
	glVertex2f(0.08, 0.42); // ѕрава€ нижн€€ вершина
	glVertex2f(0.08, 0.46); // ѕрава€ верхн€€ вершина
	glVertex2f(0.04, 0.46); // Ћева€ верхн€€ вершина

	glColor3ub(0, 0, 0);
	glVertex2f(0.08, 0.42); // Ћева€ нижн€€ вершина
	glVertex2f(0.12, 0.42); // ѕрава€ нижн€€ вершина
	glVertex2f(0.12, 0.46); // ѕрава€ верхн€€ вершина
	glVertex2f(0.08, 0.46); // Ћева€ верхн€€ вершина

	glColor3ub(0, 0, 0);
	glVertex2f(0.12, 0.42); // Ћева€ нижн€€ вершина
	glVertex2f(0.16, 0.42); // ѕрава€ нижн€€ вершина
	glVertex2f(0.16, 0.46); // ѕрава€ верхн€€ вершина
	glVertex2f(0.12, 0.46); // Ћева€ верхн€€ вершина

	glColor3ub(0, 0, 0);
	glVertex2f(0.15, 0.46); // Ћева€ нижн€€ вершина
	glVertex2f(0.16, 0.42); // ѕрава€ нижн€€ вершина
	glVertex2f(0.24, 0.5); // ѕрава€ верхн€€ вершина
	glVertex2f(0.24, 0.5); // Ћева€ верхн€€ вершина






	glColor3ub(252, 211, 165);
	glVertex2f(-0.04, 0.38); // Ћева€ нижн€€ вершина
	glVertex2f(0, 0.38); // ѕрава€ нижн€€ вершина
	glVertex2f(0, 0.42); // ѕрава€ верхн€€ вершина
	glVertex2f(-0.04, 0.42); // Ћева€ верхн€€ вершина

	glColor3ub(252, 211, 165);
	glVertex2f(0, 0.38); // Ћева€ нижн€€ вершина
	glVertex2f(0.04, 0.38); // ѕрава€ нижн€€ вершина
	glVertex2f(0.04, 0.42); // ѕрава€ верхн€€ вершина
	glVertex2f(0, 0.42); // Ћева€ верхн€€ вершина

	glColor3ub(252, 211, 165);
	glVertex2f(0.04, 0.38); // Ћева€ нижн€€ вершина
	glVertex2f(0.08, 0.38); // ѕрава€ нижн€€ вершина
	glVertex2f(0.08, 0.42); // ѕрава€ верхн€€ вершина
	glVertex2f(0.04, 0.42); // Ћева€ верхн€€ вершина

	glColor3ub(252, 211, 165);
	glVertex2f(0.08, 0.38); // Ћева€ нижн€€ вершина
	glVertex2f(0.12, 0.38); // ѕрава€ нижн€€ вершина
	glVertex2f(0.12, 0.42); // ѕрава€ верхн€€ вершина
	glVertex2f(0.08, 0.42); // Ћева€ верхн€€ вершина

	glColor3ub(252, 211, 165);
	glVertex2f(0.12, 0.38); // Ћева€ нижн€€ вершина
	glVertex2f(0.16, 0.38); // ѕрава€ нижн€€ вершина
	glVertex2f(0.16, 0.42); // ѕрава€ верхн€€ вершина
	glVertex2f(0.12, 0.42); // Ћева€ верхн€€ вершина

	//глаза
	glColor3ub(252, 211, 165);
	glVertex2f(-0.04, 0.34); // Ћева€ нижн€€ вершина
	glVertex2f(0.02, 0.34); // ѕрава€ нижн€€ вершина
	glVertex2f(0.02, 0.38); // ѕрава€ верхн€€ вершина
	glVertex2f(-0.04, 0.38); // Ћева€ верхн€€ вершина

	glColor3ub(255, 255, 255);
	glVertex2f(-0.03, 0.35); // Ћева€ нижн€€ вершина
	glVertex2f(0, 0.35); // ѕрава€ нижн€€ вершина
	glVertex2f(0, 0.37); // ѕрава€ верхн€€ вершина
	glVertex2f(-0.03, 0.37); // Ћева€ верхн€€ вершина

	glColor3ub(255, 255, 255);
	glVertex2f(-0.02, 0.34); // Ћева€ нижн€€ вершина
	glVertex2f(0, 0.34); // ѕрава€ нижн€€ вершина
	glVertex2f(0, 0.38); // ѕрава€ верхн€€ вершина
	glVertex2f(-0.02, 0.38); // Ћева€ верхн€€ вершина


	glColor3ub(132, 53, 25);
	glVertex2f(-0.02, 0.35); // Ћева€ нижн€€ вершина
	glVertex2f(-0.01, 0.35); // ѕрава€ нижн€€ вершина
	glVertex2f(-0.01, 0.37); // ѕрава€ верхн€€ вершина
	glVertex2f(-0.02, 0.37); // Ћева€ верхн€€ вершина

	glColor3ub(132, 53, 25);
	glVertex2f(-0.01, 0.34); // Ћева€ нижн€€ вершина
	glVertex2f(0.01, 0.34); // ѕрава€ нижн€€ вершина
	glVertex2f(0.01, 0.38); // ѕрава€ верхн€€ вершина
	glVertex2f(-0.01, 0.38); // Ћева€ верхн€€ вершинаррррр

	glColor3ub(252, 211, 165);
	glVertex2f(0, 0.34); // Ћева€ нижн€€ вершина
	glVertex2f(0.04, 0.34); // ѕрава€ нижн€€ вершина
	glVertex2f(0.04, 0.38); // ѕрава€ верхн€€ вершина
	glVertex2f(0, 0.38); // Ћева€ верхн€€ вершина

	glColor3ub(255, 255, 255);
	glVertex2f(0, 0.34); // Ћева€ нижн€€ вершина
	glVertex2f(0.03, 0.34); // ѕрава€ нижн€€ вершина
	glVertex2f(0.03, 0.38); // ѕрава€ верхн€€ вершина
	glVertex2f(0, 0.38); // Ћева€ верхн€€ вершина

	glColor3ub(255, 255, 255);
	glVertex2f(0.03, 0.35); // Ћева€ нижн€€ вершина
	glVertex2f(0.04, 0.35); // ѕрава€ нижн€€ вершина
	glVertex2f(0.04, 0.37); // ѕрава€ верхн€€ вершина
	glVertex2f(0.03, 0.37); // Ћева€ верхн€€ вершина

	glColor3ub(132, 53, 25);
	glVertex2f(0.01, 0.35); // Ћева€ нижн€€ вершина
	glVertex2f(0.02, 0.35); // ѕрава€ нижн€€ вершина
	glVertex2f(0.02, 0.37); // ѕрава€ верхн€€ вершина
	glVertex2f(0.01, 0.37); // Ћева€ верхн€€ вершина

	glColor3ub(132, 53, 25);
	glVertex2f(0, 0.34); // Ћева€ нижн€€ вершина
	glVertex2f(0.01, 0.34); // ѕрава€ нижн€€ вершина
	glVertex2f(0.01, 0.38); // ѕрава€ верхн€€ вершина
	glVertex2f(0, 0.38); // Ћева€ верхн€€ вершина


	glColor3ub(252, 211, 165);
	glVertex2f(0.04, 0.34); // Ћева€ нижн€€ вершина
	glVertex2f(0.09, 0.34); // ѕрава€ нижн€€ вершина
	glVertex2f(0.09, 0.38); // ѕрава€ верхн€€ вершина
	glVertex2f(0.04, 0.38); // Ћева€ верхн€€ вершина
	//------
	glColor3ub(255, 255, 255);
	glVertex2f(0.08, 0.35); // Ћева€ нижн€€ вершина второй √Ћј«
	glVertex2f(0.12, 0.35); // ѕрава€ нижн€€ вершина
	glVertex2f(0.12, 0.37); // ѕрава€ верхн€€ вершина
	glVertex2f(0.08, 0.37); // Ћева€ верхн€€ вершина

	glColor3ub(255, 255, 255);
	glVertex2f(0.09, 0.34); // Ћева€ нижн€€ вершина второй √Ћј«
	glVertex2f(0.12, 0.34); // ѕрава€ нижн€€ вершина
	glVertex2f(0.12, 0.38); // ѕрава€ верхн€€ вершина
	glVertex2f(0.09, 0.38); // Ћева€ верхн€€ вершина

	glColor3ub(255, 255, 255);
	glVertex2f(0.12, 0.34); // Ћева€ нижн€€ вершина
	glVertex2f(0.14, 0.34); // ѕрава€ нижн€€ вершина
	glVertex2f(0.14, 0.38); // ѕрава€ верхн€€ вершина
	glVertex2f(0.12, 0.38); // Ћева€ верхн€€ вершина

	glColor3ub(252, 211, 165);
	glVertex2f(0.14, 0.34); // Ћева€ нижн€€ вершина
	glVertex2f(0.16, 0.34); // ѕрава€ нижн€€ вершина
	glVertex2f(0.16, 0.38); // ѕрава€ верхн€€ вершина
	glVertex2f(0.14, 0.38); // Ћева€ верхн€€ вершина

	glColor3ub(255, 255, 255);
	glVertex2f(0.14, 0.35); // Ћева€ нижн€€ вершина
	glVertex2f(0.15, 0.35); // ѕрава€ нижн€€ вершина
	glVertex2f(0.15, 0.37); // ѕрава€ верхн€€ вершина
	glVertex2f(0.14, 0.37); // Ћева€ верхн€€ вершина  √Ћј« ѕ–ј¬џ…-->

	glColor3ub(132, 53, 25);
	glVertex2f(0.13, 0.35); // Ћева€ нижн€€ вершина
	glVertex2f(0.14, 0.35); // ѕрава€ нижн€€ вершина
	glVertex2f(0.14, 0.37); // ѕрава€ верхн€€ вершина
	glVertex2f(0.13, 0.37); // Ћева€ верхн€€ вершина  √Ћј« ѕ–ј¬џ…--

	glColor3ub(132, 53, 25);
	glVertex2f(0.11, 0.34); // Ћева€ нижн€€ вершина
	glVertex2f(0.13, 0.34); // ѕрава€ нижн€€ вершина
	glVertex2f(0.13, 0.38); // ѕрава€ верхн€€ вершина
	glVertex2f(0.11, 0.38); // Ћева€ верхн€€ вершина  √Ћј« ѕ–ј¬џ…-->

	glColor3ub(132, 53, 25);
	glVertex2f(0.10, 0.35); // Ћева€ нижн€€ вершина
	glVertex2f(0.12, 0.35); // ѕрава€ нижн€€ вершина
	glVertex2f(0.12, 0.37); // ѕрава€ верхн€€ вершина
	glVertex2f(0.10, 0.37); // Ћева€ верхн€€ вершина  √Ћј« ѕ–ј¬џ…-->







	glColor3ub(252, 211, 165);
	glVertex2f(-0.04, 0.3); // Ћева€ нижн€€ вершина
	glVertex2f(0, 0.3); // ѕрава€ нижн€€ вершина
	glVertex2f(0, 0.34); // ѕрава€ верхн€€ вершина
	glVertex2f(-0.04, 0.34); // Ћева€ верхн€€ вершина


	glVertex2f(0, 0.3); // Ћева€ нижн€€ вершина
	glVertex2f(0.04, 0.3); // ѕрава€ нижн€€ вершина
	glVertex2f(0.04, 0.34); // ѕрава€ верхн€€ вершина
	glVertex2f(0, 0.34); // Ћева€ верхн€€ вершина


	glVertex2f(0.04, 0.3); // Ћева€ нижн€€ вершина
	glVertex2f(0.08, 0.3); // ѕрава€ нижн€€ вершина
	glVertex2f(0.08, 0.34); // ѕрава€ верхн€€ вершина
	glVertex2f(0.04, 0.34); // Ћева€ верхн€€ вершина


	glVertex2f(0.08, 0.3); // Ћева€ нижн€€ вершина
	glVertex2f(0.12, 0.3); // ѕрава€ нижн€€ вершина
	glVertex2f(0.12, 0.34); // ѕрава€ верхн€€ вершина
	glVertex2f(0.08, 0.34); // Ћева€ верхн€€ вершина


	glVertex2f(0.12, 0.3); //Ћева€ нижн€€ вершина
	glVertex2f(0.16, 0.3); // ѕрава€ нижн€€ вершина
	glVertex2f(0.16, 0.34); // ѕрава€ верхн€€ вершина
	glVertex2f(0.12, 0.34); // Ћева€ верхн€€ вершина

	glVertex2f(-0.02, 0.28); // Ћева€ нижн€€ вершина
	glVertex2f(0.04, 0.28); // ѕрава€ нижн€€ вершина
	glVertex2f(0.04, 0.3); // ѕрава€ верхн€€ вершина
	glVertex2f(-0.02, 0.3); // Ћева€ верхн€€ вершина

	glVertex2f(0, 0.26); // Ћева€ нижн€€ вершина
	glVertex2f(0.04, 0.26); // ѕрава€ нижн€€ вершина
	glVertex2f(0.04, 0.3); // ѕрава€ верхн€€ вершина
	glVertex2f(0, 0.3); // Ћева€ верхн€€ вершина


	glVertex2f(0.04, 0.26); // Ћева€ нижн€€ вершина
	glVertex2f(0.08, 0.26); // ѕрава€ нижн€€ вершина
	glVertex2f(0.08, 0.3); // ѕрава€ верхн€€ вершина
	glVertex2f(0.04, 0.3); // Ћева€ верхн€€ вершина


	glVertex2f(0.08, 0.26); // Ћева€ нижн€€ вершина
	glVertex2f(0.12, 0.26); // ѕрава€ нижн€€ вершина
	glVertex2f(0.12, 0.3); // ѕрава€ верхн€€ вершина
	glVertex2f(0.08, 0.3); // Ћева€ верхн€€ вершина

	glVertex2f(0.12, 0.28); // Ћева€ нижн€€ вершина
	glVertex2f(0.14, 0.28); // ѕрава€ нижн€€ вершина
	glVertex2f(0.14, 0.3); // ѕрава€ верхн€€ вершина
	glVertex2f(0.12, 0.3); // Ћева€ верхн€€ вершина

	glColor3ub(248, 155, 145);
	glVertex2f(0.04, 0.29); // Ћева€ нижн€€ вершина
	glVertex2f(0.08, 0.29); // ѕрава€ нижн€€ вершина
	glVertex2f(0.08, 0.3); // ѕрава€ верхн€€ вершина
	glVertex2f(0.04, 0.3); // Ћева€ верхн€€ вершина

	glColor3ub(51, 48, 48);
	glVertex2f(0.04, 0.22); // Ћева€ нижн€€ вершина
	glVertex2f(0.08, 0.22); // ѕрава€ нижн€€ вершина
	glVertex2f(0.08, 0.26); // ѕрава€ верхн€€ вершина
	glVertex2f(0.04, 0.26); // Ћева€ верхн€€ вершина

	glColor3ub(51, 48, 48);
	glVertex2f(0, 0.22); // Ћева€ нижн€€ вершина
	glVertex2f(0.04, 0.22); // ѕрава€ нижн€€ вершина
	glVertex2f(0.04, 0.26); // ѕрава€ верхн€€ вершина
	glVertex2f(0, 0.26); // Ћева€ верхн€€ вершина////




	glColor3ub(51, 48, 48);
	glVertex2f(-0.04, 0.22); // Ћева€ нижн€€ вершина
	glVertex2f(0, 0.22); // ѕрава€ нижн€€ вершина
	glVertex2f(0, 0.26); // ѕрава€ верхн€€ вершина
	glVertex2f(-0.04, 0.26); // Ћева€ верхн€€ вершина

	glColor3ub(51, 48, 48);
	glVertex2f(-0.08, 0.22); // Ћева€ нижн€€ вершина
	glVertex2f(-0.04, 0.22); // ѕрава€ нижн€€ вершина
	glVertex2f(-0.04, 0.26); // ѕрава€ верхн€€ вершина
	glVertex2f(-0.08, 0.26); // Ћева€ верхн€€ вершина

	glColor3ub(51, 48, 48);
	glVertex2f(-0.12, 0.18); // Ћева€ нижн€€ вершина
	glVertex2f(-0.08, 0.18); // ѕрава€ нижн€€ вершина
	glVertex2f(-0.08, 0.22); // ѕрава€ верхн€€ вершина
	glVertex2f(-0.12, 0.22); // Ћева€ верхн€€ вершина

	glColor3ub(252, 211, 165);
	glVertex2f(-0.12, 0.14); // Ћева€ нижн€€ вершина
	glVertex2f(-0.08, 0.14); // ѕрава€ нижн€€ вершина
	glVertex2f(-0.08, 0.18); // ѕрава€ верхн€€ вершина
	glVertex2f(-0.12, 0.18); // Ћева€ верхн€€ вершина

	glColor3ub(51, 48, 48);
	glVertex2f(0.04, 0.22); // Ћева€ нижн€€ вершина
	glVertex2f(0.08, 0.22); // ѕрава€ нижн€€ вершина
	glVertex2f(0.08, 0.26); // ѕрава€ верхн€€ вершина
	glVertex2f(0.04, 0.26); // Ћева€ верхн€€ вершина

	glColor3ub(51, 48, 48);
	glVertex2f(0.08, 0.22); // Ћева€ нижн€€ вершина
	glVertex2f(0.12, 0.22); // ѕрава€ нижн€€ вершина
	glVertex2f(0.12, 0.26); // ѕрава€ верхн€€ вершина
	glVertex2f(0.08, 0.26); // Ћева€ верхн€€ вершина

	glColor3ub(51, 48, 48);
	glVertex2f(0.12, 0.22); // Ћева€ нижн€€ вершина
	glVertex2f(0.16, 0.22); // ѕрава€ нижн€€ вершина
	glVertex2f(0.16, 0.26); // ѕрава€ верхн€€ вершина
	glVertex2f(0.12, 0.26); // Ћева€ верхн€€ вершина

	glColor3ub(51, 48, 48);
	glVertex2f(0.16, 0.22); // Ћева€ нижн€€ вершина
	glVertex2f(0.2, 0.22); // ѕрава€ нижн€€ вершина
	glVertex2f(0.2, 0.26); // ѕрава€ верхн€€ вершина
	glVertex2f(0.16, 0.26); // Ћева€ верхн€€ вершина

	glColor3ub(51, 48, 48);
	glVertex2f(0.2, 0.18); // Ћева€ нижн€€ вершина
	glVertex2f(0.24, 0.18); // ѕрава€ нижн€€ вершина
	glVertex2f(0.24, 0.22); // ѕрава€ верхн€€ вершина
	glVertex2f(0.2, 0.22); // Ћева€ верхн€€ вершина

	glColor3ub(252, 211, 165);
	glVertex2f(0.2, 0.14); // Ћева€ нижн€€ вершина
	glVertex2f(0.24, 0.14); // ѕрава€ нижн€€ вершина
	glVertex2f(0.24, 0.18); // ѕрава€ верхн€€ вершина
	glVertex2f(0.2, 0.18); // Ћева€ верхн€€ вершина

	glColor3ub(51, 48, 48);
	glVertex2f(0.08, 0.18); // Ћева€ нижн€€ вершина
	glVertex2f(0.12, 0.18); // ѕрава€ нижн€€ вершина
	glVertex2f(0.12, 0.22); // ѕрава€ верхн€€ вершина
	glVertex2f(0.08, 0.22); // Ћева€ верхн€€ вершина

	glColor3ub(51, 48, 48);
	glVertex2f(0.08, 0.14); // Ћева€ нижн€€ вершина
	glVertex2f(0.12, 0.14); // ѕрава€ нижн€€ вершина
	glVertex2f(0.12, 0.18); // ѕрава€ верхн€€ вершина
	glVertex2f(0.08, 0.18); // Ћева€ верхн€€ вершина
	glColor3ub(51, 48, 48);
	glVertex2f(0.08, 0.1); // Ћева€ нижн€€ вершина
	glVertex2f(0.12, 0.1); // ѕрава€ нижн€€ вершина
	glVertex2f(0.12, 0.14); // ѕрава€ верхн€€ вершина
	glVertex2f(0.08, 0.14); // Ћева€ верхн€€ вершина

	glColor3ub(51, 48, 48);
	glVertex2f(0.12, 0.18); // Ћева€ нижн€€ вершина
	glVertex2f(0.16, 0.18); // ѕрава€ нижн€€ вершина
	glVertex2f(0.16, 0.22); // ѕрава€ верхн€€ вершина
	glVertex2f(0.12, 0.22); // Ћева€ верхн€€ вершина

	glColor3ub(51, 48, 48);
	glVertex2f(0.12, 0.14); // Ћева€ нижн€€ вершина
	glVertex2f(0.16, 0.14); // ѕрава€ нижн€€ вершина
	glVertex2f(0.16, 0.18); // ѕрава€ верхн€€ вершина
	glVertex2f(0.12, 0.18); // Ћева€ верхн€€ вершина

	glColor3ub(51, 48, 48);
	glVertex2f(0.12, 0.1); // Ћева€ нижн€€ вершина
	glVertex2f(0.16, 0.1); // ѕрава€ нижн€€ вершина
	glVertex2f(0.16, 0.14); // ѕрава€ верхн€€ вершина
	glVertex2f(0.12, 0.14); // Ћева€ верхн€€ вершина

	glColor3ub(51, 48, 48);
	glVertex2f(0.04, 0.18); // Ћева€ нижн€€ вершина
	glVertex2f(0.08, 0.18); // ѕрава€ нижн€€ вершина
	glVertex2f(0.08, 0.22); // ѕрава€ верхн€€ вершина
	glVertex2f(0.04, 0.22); // Ћева€ верхн€€ вершина

	glColor3ub(51, 48, 48);
	glVertex2f(0.04, 0.14); // Ћева€ нижн€€ вершина
	glVertex2f(0.08, 0.14); // ѕрава€ нижн€€ вершина
	glVertex2f(0.08, 0.18); // ѕрава€ верхн€€ вершина
	glVertex2f(0.04, 0.18); // Ћева€ верхн€€ вершина

	glColor3ub(51, 48, 48);
	glVertex2f(0.04, 0.1); // Ћева€ нижн€€ вершина
	glVertex2f(0.08, 0.1); // ѕрава€ нижн€€ вершина
	glVertex2f(0.08, 0.14); // ѕрава€ верхн€€ вершина
	glVertex2f(0.04, 0.14); // Ћева€ верхн€€ вершина

	glColor3ub(51, 48, 48);
	glVertex2f(0, 0.18); // Ћева€ нижн€€ вершина
	glVertex2f(0.04, 0.18); // ѕрава€ нижн€€ вершина
	glVertex2f(0.04, 0.22); // ѕрава€ верхн€€ вершина
	glVertex2f(0, 0.22); // Ћева€ верхн€€ вершина

	glColor3ub(51, 48, 48);
	glVertex2f(0, 0.14); // Ћева€ нижн€€ вершина
	glVertex2f(0.04, 0.14); // ѕрава€ нижн€€ вершина
	glVertex2f(0.04, 0.18); // ѕрава€ верхн€€ вершина
	glVertex2f(0, 0.18); // Ћева€ верхн€€ вершина

	glColor3ub(51, 48, 48);
	glVertex2f(-0.04, 0.14); // Ћева€ нижн€€ вершина
	glVertex2f(0, 0.14); // ѕрава€ нижн€€ вершина
	glVertex2f(0, 0.18); // ѕрава€ верхн€€ вершина
	glVertex2f(-0.04, 0.18); // Ћева€ верхн€€ вершина

	glColor3ub(51, 48, 48);
	glVertex2f(-0.04, 0.18); // Ћева€ нижн€€ вершина
	glVertex2f(0, 0.18); // ѕрава€ нижн€€ вершина
	glVertex2f(0, 0.22); // ѕрава€ верхн€€ вершина
	glVertex2f(-0.04, 0.22); // Ћева€ верхн€€ вершина

	glColor3ub(51, 48, 48);
	glVertex2f(-0.04, 0.1); // Ћева€ нижн€€ вершина
	glVertex2f(0, 0.1); // ѕрава€ нижн€€ вершина
	glVertex2f(0, 0.14); // ѕрава€ верхн€€ вершина
	glVertex2f(-0.04, 0.14); // Ћева€ верхн€€ вершина

	glColor3ub(51, 48, 48);
	glVertex2f(0, 0.1); // Ћева€ нижн€€ вершина
	glVertex2f(0.04, 0.1); // ѕрава€ нижн€€ вершина
	glVertex2f(0.04, 0.14); // ѕрава€ верхн€€ вершина
	glVertex2f(0, 0.14); // Ћева€ верхн€€ вершина

	glColor3ub(102, 60, 52);
	glVertex2f(-0.04, 0.06); // Ћева€ нижн€€ вершина
	glVertex2f(0, 0.06); // ѕрава€ нижн€€ вершина
	glVertex2f(0, 0.1); // ѕрава€ верхн€€ вершина
	glVertex2f(-0.04, 0.1); // Ћева€ верхн€€ вершина

	glColor3ub(61, 50, 41);
	glVertex2f(-0.04, 0.02); // Ћева€ нижн€€ вершина
	glVertex2f(0, 0.02); // ѕрава€ нижн€€ вершина
	glVertex2f(0, 0.06); // ѕрава€ верхн€€ вершина
	glVertex2f(-0.04, 0.06); // Ћева€ верхн€€ вершина

	glColor3ub(102, 60, 52);
	glVertex2f(-0.08, 0.02); // Ћева€ нижн€€ вершина
	glVertex2f(-0.04, 0.02); // ѕрава€ нижн€€ вершина
	glVertex2f(-0.04, 0.06); // ѕрава€ верхн€€ вершина
	glVertex2f(-0.08, 0.06); // Ћева€ верхн€€ вершина

	glColor3ub(102, 60, 52);
	glVertex2f(0.12, 0.06); // Ћева€ нижн€€ вершина
	glVertex2f(0.16, 0.06); // ѕрава€ нижн€€ вершина
	glVertex2f(0.16, 0.1); // ѕрава€ верхн€€ вершина
	glVertex2f(0.12, 0.1); // Ћева€ верхн€€ вершина

	glColor3ub(61, 50, 41);
	glVertex2f(0.12, 0.02); // Ћева€ нижн€€ вершина
	glVertex2f(0.16, 0.02); // ѕрава€ нижн€€ вершина
	glVertex2f(0.16, 0.06); // ѕрава€ верхн€€ вершина
	glVertex2f(0.12, 0.06); // Ћева€ верхн€€ вершина
	glColor3ub(102, 60, 52);
	glVertex2f(0.16, 0.02); // Ћева€ нижн€€ вершина
	glVertex2f(0.2, 0.02); // ѕрава€ нижн€€ вершина
	glVertex2f(0.2, 0.06); // ѕрава€ верхн€€ вершина
	glVertex2f(0.16, 0.06); // Ћева€ верхн€€ вершина

	glEnd();
	glPopMatrix();
}